# Distance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ClosestPointsPairBetweenTwoCurves..::..Distance Property
ClosestPointsPairBetweenTwoCurves Class See Also
---
Distance from point on first curve to the point on second curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public double Distance { get; set; }
```

Visual Basic
---
```text
Public Property Distance As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Distance {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The property has not been set by the method providing the result. |

# See Also
ClosestPointsPairBetweenTwoCurves Class
Autodesk.Revit.DB Namespace